import { Component } from '@angular/core';
import { cook_detail } from '../cook_detail/cook_detail';
import { NavController } from 'ionic-angular';
@Component({
  selector: 'type-food1-page',
  templateUrl: 'type_food1.html'
})
export class type_food1 {
  food = [
    ["1", "2", "3", "4", "5", "7",],
    ["ก", "ข", "ค", "ง", "จ", "ช",],
    ["A", "B", "C", "D", "E", "F",],
    ["a", "b", "c", "d", "e", "f",]
  ];
  constructor(public navCtrl: NavController) {

  }
  getfood() {
    return this.food;
  }
  goto_cook_detail(food) {
    if (food == 1) {
      this.navCtrl.push(cook_detail, {
        name: "ซุปไข่มักกะโรนี",
        link_img: "https://scm-assets.constant.co/scm/unilever/a6798e909fa57bfd19c3e7f00737e5d6/f24c927c-9420-436c-9873-8e814487acfb.jpg",
        solution: [
          "ตั้งหม้อบนเตาแก๊สจากนั้นใส่น้ำเปล่าลงไป โดยใช้ไฟปานกลาง เมื่อน้ำเริ่มเดือดให้ใส่ ซุปไก่ก้อน คนอร์ เนเชอรัล ลงไปในน้ำเดือด ตามด้วยเกลือและพริกไทย",
          "ใส่แครอทหั่นเต๋าลงไปต้มจนแครอทนิ่มค่อยใส่เนื้อสัตว์เข้าไป",
          "เมื่อแครอทสุกแล้วใส่กุ้งสดลงไป จากนั้นนำไข่ไก่มาเทลงบนตะแกรง แล้ววนตะแกรงให้ไข่ไหลลงเป็นเส้นลงในหม้อ จากนั้นใช้ทัพพีคนน้ำซุปเพื่อไม่ให้ไข่ติดกัน",
          "ใส่มักกะโรนีต้มสุกลงไปในหม้อ รอให้น้ำเดือดอีกครั้ง ยกลงจากเตา",
          "ตักซุปไข่มักกะโรนีใส่ลงในถ้วย ตกแต่งด้วยผักชี"
        ],
        staple: [
          "มักกะโรนีต้มสุก 300 กรัม ",
          "ซุปไก่ก้อน คนอร์ เนเชอรัล 1 ก้อน ",
          "ไข่ไก่ 3 ฟอง ",
          "กุ้งสด 13 ตัว ",
          "แครอทหั่นเต๋า 2 หัว",
          "เกลือ 2 ช้อนชา ",
          "พริกไทยป่น 1 ช้อนชา ",
          "น้ำเปล่า 2 ลิตร ",
        ],
        level: 3,
        nlevel: 2,
        time_solu: 20,
        time_sta: 10
      });
    } else if (food == 2) {
      this.navCtrl.push(cook_detail, {
        name: "แกงส้มหนูน้อย",
        link_img: "https://scm-assets.constant.co/scm/unilever/1d398653b55393fd6da9bff8ea193338/48af5aca-cc10-47c7-a371-edea926bfb79.jpg",
        solution: [
          "นำหม้อขึ้นตั้งไฟปานกลาง เทน้ำเปล่าลงไป และรอจนเดือด ใส่ ซุปหมูก้อน คนอร์ เนเชอรัล ลงไป ตามด้วยซอสมะเขือเทศ และแซลมอนบด",
          "ใส่แครอท บรอคโคลี หัวไชเท้า ดอกกะหล่ำ และถั่วฝักยาว ต้มจนสุก",
          "ใส่แซลมอนลงไป ต้มจนสุก และยกออกจากเตา",
          "ตักแกงส้มใส่ชาม และเสิร์ฟพร้อมกับข้าวเปล่า"
        ],
        staple: [
          "ข้าวเปล่า 1 ถ้วย",
          "น้ำเปล่า 500 มิลลิลิตร",
          "ซุปหมูก้อน คนอร์ เนเชอรัล 1 ก้อน ",
          "แครอท 30 กรัม",
          "หัวไชเท้า 30 กรัม",
          "บรอคโคลี 30 กรัม",
          "ดอกกะหล่ำ 30 กรัม ",
          "แซลมอนบด 100 กรัม ",
          "แซลมอนหั่นเต๋า 100 กรัม ",
          "ซอสมะเขือเทศ 2 ช้อนโต๊ะ ",
          "ถั่วฝักยาว 30 กรัม"
        ],
        level: 4,
        nlevel: 1,
        time_solu: 10,
        time_sta: 10
      });
    } else if (food == 3) {
      this.navCtrl.push(cook_detail, {
        name: "แกงไก่หน่อไม้ดอง",
        link_img: "https://scm-assets.constant.co/scm/unilever/1d398653b55393fd6da9bff8ea193338/d2175818-0326-4032-8887-532459d55c78.jpg",
        solution: [
          "นำหน่อไม้ดองไปล้างให้สะอาดแล้วหั่นเป็นแท่งยาวเตรียมไว้",
          "หั่นข่า ตะไคร้ พริกชี้ฟ้าแห้ง ปอกกระเทียมและหอมแดงเตรียมไว้",
          "นำพริกชี้ฟ้าแห้งกับเกลือโขลกรวมกัน ตามด้วย ข่า ตะไคร้ กระเทียม หอมแดง และผิวมะกรูด โขลกทุกอย่างรวมกันให้ละเอียด แล้วใส่กะปิ โขลกจนเป็นเนื้อเดียว",
          "นำไก่บ้านมาสับเป็นชิ้นๆ แยกส่วนกัน ทั้งสะโพก อก น่อง",
          "ตั้งหม้อ ใส่น้ำ พอเดือด เอาไก่ที่เราหั่นเป็นชิ้นเตรียมไว้และหน่อไม้ลงไปรวนให้พอสุก",
          "ตักแกงเผ็ดไก่บ้านหน่อไม้ดองใส่ถ้วยเสิร์ฟพร้อมข้าวสวยหุงสุก"
        ],
        staple: [
          "หน่อไม้ดอง",
          "เกลือ",
          "ข่า",
          "ตะไคร้",
          "ผิวมะกรูด",
          "หอมแดง",
          "กระเทียม",
          "พริกขี้หนู",
          "กะปิ",
          "ไก่บ้าน (เด็ก)",
          "ใบมะกรูด",
          "ใบกะเพรา",
          "น้ำปลา",
          "พริกแห้ง",
          "น้ำตาลทราย"
        ],
        level: 3,
        nlevel: 2,
        time_solu: 15,
        time_sta: 20
      });
    } else if (food == 4) {
      this.navCtrl.push(cook_detail, {
        name: "ต้มยำไก่บ้านใบมะขามอ่อน",
        link_img: "https://scm-assets.constant.co/scm/unilever/1d398653b55393fd6da9bff8ea193338/477463e1-9be6-425b-bf83-0b5e6a686c0b.jpg",
        solution: [
          "นำไก่บ้านที่ล้างให้สะอาดแล้วมาสับเป็นชิ้นพอดีคำ แล้วพักเอาไว้เตรียมนำไปทำต้มยำ",
          "นำหม้อใส่น้ำเปล่ายกขึ้นตั้งไฟโดยใช้ปานกลาง เมื่อน้ำเริ่มร้อนใส่ คนอร์ซุปไก่ก้อน ลงไปในหม้อ ตามด้วยข่า ตะไคร้ พริกขี้หนูบุบ และเนื้อไก่ลงไป คอยช้อนฟองเรื่อย ๆ เพื่อให้น้ำซุปใสขึ้นค่ะ",
          "เมื่อเนื้อไก่เริ่มสุกให้ปรุงรสด้วยน้ำปลา เกลือ และพริกขี้หนูบุบ ตามด้วยใบมะขามอ่อนคนให้เข้ากันแล้วปิดไฟ ยกลงจากเตาเตรียมจัดเสิร์ฟได้เลย",
          "ตักต้มยำไก่บ้านใบมะขามอ่อนใส่ในชาม เท่านี้ก็พร้อมกินแล้วจ้า"
        ],
        staple: [
          "เนื้อไก่บ้าน 1 / 2 ตัว",
          "น้ำเปล่า 2 ลิตร น้ำ",
          "ใบมะขามอ่อน 1 ถ้วย",
          "ใบมะกรูดฉีก 4 ใบ ใบมะกรูดสด",
          "ข่าหั่น 1 หัว",
          "พริกขี้หนูบุบ 10 เม็ด พริกขี้หนู",
          "ตะไคร้หั่นท่อน 2 ต้น ตะไคร้สด",
          "น้ำปลา 2 ช้อนโต๊ะ น้ำปลา",
          "เกลือ 1 ช้อนชา เกลือ",
          "คนอร์ซุปไก่ก้อน 1 ก้อน",
          "ผักชีฝรั่ง สำหรับโรยหน้า"
        ],
        level: 4,
        nlevel: 1,
        time_solu: 30,
        time_sta: 20
      });
    } else if (food == 5) {
      this.navCtrl.push(cook_detail, {
        name: "อุด้งต้มโคล้งปลาสลิดทอด",
        link_img: "https://scm-assets.constant.co/scm/unilever/a6798e909fa57bfd19c3e7f00737e5d6/af1021d4-3645-4e70-b7b9-bfab248dd941.png",
        solution: [
          "ปอกหอมเเดง กระเทียม ทุบหอมเเดง กระเทียมเบาๆ หั่นมะเขือเทศ ซอยผข่า หั่นตะไคร้ยาวประมาณหนึ่งนิ้วทุบพอให้มีกลิ่นเบาๆ ฉีกใบมะกรูดเตรียมไว้",
          "ตั้งกระทะคั่ว หอมเเดง กระเทียม ตะไคร้ พริกเเห้ง ข่า ให้มีกลิ่นหอมยิ่งขึ้น คั่วไปอ่อนพอมีกลิ่นหอมตักพักเตรียมไว้",
          "เมื่อแครอทสุกแล้วใส่กุ้งสดลงไป จากนั้นนำไข่ไก่มาเทลงบนตะแกรง แล้ววนตะแกรงให้ไข่ไหลลงเป็นเส้นลงในหม้อ จากนั้นใช้ทัพพีคนน้ำซุปเพื่อไม่ให้ไข่ติดกัน",
          "ตั้งกระทะ ใส่น้ำมัน ทอดปลาสลิดลงในกระทะ จนสุกกรอบ ตักพักให้หายร้อน เเกะก้างปลาออกเตรียมไว้สองส่วน อีกส่วนนำเนื้อไปตำในครกให้ละเอียดเตรียมไว้ อีกส่วนเเกะเตรียมไว้ใส่เป็นชิ้น",
          "คั้นนำมะขามเปียก เเยกกากเตรียมไว้",
          "ตั้งหม้อใส่นำต้มให้เดือด ใส่ซุปก้อน ใส่สมุนไพรที่คั่วเตรียมไว้ในหม้อ ใส่มะเขือเทศ ใส่ปลาสลิดที่ตำไว้รอเดือด ปรุงรสด้วยน้ำมะขามเปียก น้ำปลา น้ำตาล เกลือ พริกป่น บีบมะนาวเพิ่มความหอม ใส่ปลาสลิดชิ้นที่เเกะไว้ลงในหม้อ ใส่ใบกะเพราแล้วปิดไฟพักรอไว้",
          "ตั้งหม้อน้ำ ลวกเส้นอุด้งจนสุก ตักพักให้สะเด็ดน้ำ",
          "ใส่เส้นอุด้งจัดใส่ถ้วย ตักราดด้วยต้มโคล้ง โรยหน้าด้วยปลาสลิด พร้อมเสิร์ฟ"
        ],
        staple: [
          "ปลาสลิดบางบ่อ (วัตถุดิบหลักหั่นท่อน1.5 นิ้ว) 200 กรัม",
          "พริกขี้หนูเเห้ง 8-10 เม็ด",
          "หอมเเดง 4 หัว",
          "กระเทียม 4 กลีบ",
          "ตะไคร้หั่นท่อน 2 นิ้วบุป 1 ต้น",
          "ข่าหั่นแว่น 6 แว่น",
          "ใบมะกรูดฉีก 5 ใบ",
          "น้ำเปล่า 3 ถ้วยตวง",
          "มะเขือเทศศรีดา ผ่าครึ่ง 3 ลูก",
          "คนอร์ซุปไก่ก้อน 1 ก้อน",
          "มะนาว, น้ำปลา, น้ำตาล, เกลือ, พริกป่น และมะขามเปียกสำหรับปรุงรสตามชอบ",
          "ใบกะเพราตามชอบ",
          "เส้นอุด้งลวก 200 กรัม"
        ],
        level: 3,
        nlevel: 2,
        time_solu: 30,
        time_sta: 20
      });
    }
  }
}