import { Component } from '@angular/core';
import { cook_detail } from '../cook_detail/cook_detail';
import { NavController } from 'ionic-angular';
@Component({
  selector: 'type-food2-page',
  templateUrl: 'type_food2.html'
})
export class type_food2 {
  
  constructor(public navCtrl: NavController) {

  }

  goto_cook_detail(food) {
    if (food == 1) {
      this.navCtrl.push(cook_detail, {
        name: "ไก่กรอบลาบแซ่บ",
        link_img: "assets/imgs/fire_type/ไก่กรอบลาบแซ่บ.jpg",
        solution: [
          "เริ่มแรกให้ล้างปีกบนไก่ให้สะอาด แล้วซับด้วยกระดาษทิชชูให้แห้ง",
          "โรยเกลือป่น พริกไทยดำป่นแล้วคลุกเคล้าให้ทั่ว",
          "คลุกไก่กับแป้งทอดกรอบจนติดทั่วชิ้น",
          "นำไก่ไปทอดในน้ำมันร้อนปานกลาง จนสุกเหลืองกรอบ แล้วตักขึ้นสะเด็ดน้ำมัน",
          "โรยคนอร์สูตรสำเร็จ ลาบ-น้ำตก แล้วคลุกเคล้าให้เคลือบไก่ทอดทั่วกันดี ใส่จานเสิร์ฟพร้อมผักสดได้เลย"
        ],
        staple: [
          "ปีกบนไก่ (น่องไก่เล็ก) 500 กรัม",
          "เกลือป่นและพริกไทยดำป่นปริมาณเล็กน้อยสำหรับหมักไก่",
          "แป้งทอดกรอบ 1 ถ้วย",
          "คนอร์สูตรสำเร็จ ลาบ-น้ำตก 2 ซอง",
          "น้ำมันพืชสำหรับทอดไก่",
          "ผักสดเครื่องเคียง อย่างเช่นกะหล่ำปลี แตงกวา ถั่วฝักยาว โหระพา"
        ],
        level: 3,
        time_solu: 15,
        time_sta: 10
      });
    } else if (food == 2) {
      this.navCtrl.push(cook_detail, {
        name: "ไข่เจียวลาบ",
        link_img: "assets/imgs/fire_type/ไข่เจียวลาบ.jpg",
        solution: [
          "ตอกไข่ใส่ชาม แล้วตีไข่ด้วยส้อมจนขึ้นฟู",
          "ใส่น้ำมันลงกระทะก้นลึก ตั้งไฟร้อนปานกลาง ลองหยอดไข่ที่ตีไว้ลงไปเล็กน้อย ถ้าไข่ที่หยอดลงไปสุกฟูทันที แสดงว่าน้ำมันร้อนได้ที่แล้ว จึงเทไข่ที่เตรียมไว้ลงไปทอดทั้งหมดได้เลย",
          "เมื่อไข่ด้านล่างเริ่มเหลืองกรอบให้กลับด้านไข่เจียว แล้วทอดจนเหลืองกรอบทั้งสองด้าน",
          "ตักขึ้นให้สะเด็ดน้ำมันแล้วจัดใส่จาน",
          "ผสมหอมแดง ต้นหอม ผักชีฝรั่ง สะระแหน่ กับคนอร์สูตรสำเร็จ ลาบ-น้ำตก คลุกเคล้าให้เข้ากัน ถ้าแห้งเกินไป สามารถเติมน้ำเปล่าต้มสุกใส่ลงไปพอให้ขลุกขลิกได้เช่นกัน จากนั้นตักราดบนไข่เจียว รับรองว่าอร่อยแซ่บสุดๆ"
        ],
        staple: [
          "ไข่ไก่ 4 ฟอง",
          "หอมแดงซอย 2 ช้อนโต๊ะ",
          "ต้นหอมซอย 2 ช้อนโต๊ะ",
          "ผักชีฝรั่งซอย 2 ช้อนโต๊ะ",
          "สะระแหน่เด็ดใบ ½ ถ้วย",
          "คนอร์สูตรสำเร็จ ลาบ-น้ำตก 2 ช้อนโต๊ะ",
          "น้ำมันพืชสำหรับเจียวไข่"
        ],
        level: 1,
        time_solu: 10,
        time_sta: 5
      });
    } else if (food == 3) {
      this.navCtrl.push(cook_detail, {
        name: "โรตีแกงเขียวหวานเนื้อ",
        link_img: "assets/imgs/fire_type/โรตีแกงเขียวหวานเนื้อ.jpg",
        solution: [
          "เริ่มทำแกงเขียวหวานเนื้อ ใส่กะทิลงในหม้อแล้วยกขึ้นตั้งไฟจนเดือด ใส่คนอร์สูตรสำเร็จแกงเขียวหวานลงไป คนจนละลายเข้ากันดี",
          "พอน้ำแกงเดือดอีกครั้งใส่เนื้อวัวลงไป แล้วคนให้เข้ากัน",
          "ใส่มะเขือพวง ใบมะกรูด พริกชี้ฟ้าลงไปต้มจนสุกตามความชอบ หากชอบผักนิ่มๆ สามารถต้มให้นานขึ้นจนผักเปื่อยนุ่มได้",
          "ใส่ใบโหระพาลงไป แล้วปิดไฟตักใส่ชามเสิร์ฟได้เลย",
          "ลงมือทอดโรตี ตั้งกระทะบนไฟกลาง ใส่เนยลงไป พอเนยเริ่มละลายใส่โรตีลงทอดจนเหลือง และกลิ่นหอม จากนั้นหั่นเป็นชิ้น จัดใส่จาน ทานคู่กับแกงเขียวหวานเนื้อ รับรองอร่อยสุดๆ"
        ],
        staple: [
          "กะทิ 2 ถ้วย",
          "คนอร์สูตรสำเร็จแกงเขียวหวาน 1 ซอง",
          "สันในวัวแล่เป็นชิ้นบาง 200 กรัม",
          "มะเขือพวง ½ ถ้วย",
          "ใบมะกรูดฉีก 4 ใบ",
          "พริกชี้ฟ้าแดงซอย 1 เม็ด",
          "โหระพาเด็ดใบ 1 ถ้วย",
          "เนยสดชนิดจืดสำหรับทอดโรตี 1 ช้อนโต๊ะ",
          "แผ่นแป้งโรตีแช่แข็ง 3 แผ่น"
        ],
        level: 2,
        time_solu: 20,
        time_sta: 15
      });
    } 
  }
}