import { HttpClient } from '@angular/common/http';
import { Injectable } from '@angular/core';

/*
  Generated class for the FoodListProvider provider.

  See https://angular.io/guide/dependency-injection for more info on providers
  and Angular DI.
*/
@Injectable()
export class FoodListProvider {
  test: any = "555555";
  food_list: any = [
    ['ซุปไข่มักกะโรนี', 'https://scm-assets.constant.co/scm/unilever/a6798e909fa57bfd19c3e7f00737e5d6/f24c927c-9420-436c-9873-8e814487acfb.jpg', ['ตั้งหม้อบนเตาแก๊สจากนั้นใส่น้ำเปล่าลงไป โดยใช้ไฟปานกลาง เมื่อน้ำเริ่มเดือดให้ใส่ ซุปไก่ก้อน คนอร์ เนเชอรัล ลงไปในน้ำเดือด ตามด้วยเกลือและพริกไทย', 'ใส่แครอทหั่นเต๋าลงไปต้มจนแครอทนิ่มค่อยใส่เนื้อสัตว์เข้าไป', 'เมื่อแครอทสุกแล้วใส่กุ้งสดลงไป จากนั้นนำไข่ไก่มาเทลงบนตะแกรง แล้ววนตะแกรงให้ไข่ไหลลงเป็นเส้นลงในหม้อ จากนั้นใช้ทัพพีคนน้ำซุปเพื่อไม่ให้ไข่ติดกัน', 'ใส่มักกะโรนีต้มสุกลงไปในหม้อ รอให้น้ำเดือดอีกครั้ง ยกลงจากเตา', 'ตักซุปไข่มักกะโรนีใส่ลงในถ้วย ตกแต่งด้วยผักชี'], ['มักกะโรนีต้มสุก 300 กรัม', 'ซุปไก่ก้อน คนอร์ เนเชอรัล 1 ก้อน ', 'ไข่ไก่ 3 ฟอง ', 'กุ้งสด 13 ตัว', 'แครอทหั่นเต๋า 2 หัว', 'เกลือ 2 ช้อนชา ', 'พริกไทยป่น 1 ช้อนชา ', 'น้ำเปล่า 2 ลิตร '], '3', '20', '10'],
    ['แกงส้มหนูน้อย', 'https://scm-assets.constant.co/scm/unilever/1d398653b55393fd6da9bff8ea193338/48af5aca-cc10-47c7-a371-edea926bfb79.jpg', ['นำหม้อขึ้นตั้งไฟปานกลาง เทน้ำเปล่าลงไป และรอจนเดือด ใส่ ซุปหมูก้อน คนอร์ เนเชอรัล ลงไป ตามด้วยซอสมะเขือเทศ และแซลมอนบด', 'ใส่แครอท บรอคโคลี หัวไชเท้า ดอกกะหล่ำ และถั่วฝักยาว ต้มจนสุก', 'ใส่แซลมอนลงไป ต้มจนสุก และยกออกจากเตา', 'ตักแกงส้มใส่ชาม และเสิร์ฟพร้อมกับข้าวเปล่า'], ['ข้าวเปล่า 1 ถ้วย', 'น้ำเปล่า 500 มิลลิลิตร', 'ซุปหมูก้อน คนอร์ เนเชอรัล 1 ก้อน ', 'แครอท 30 กรัม', 'หัวไชเท้า 30 กรัม', 'บรอคโคลี 30 กรัม', 'ดอกกะหล่ำ 30 กรัม ', 'แซลมอนบด 100 กรัม ', 'แซลมอนหั่นเต๋า 100 กรัม ', 'ซอสมะเขือเทศ 2 ช้อนโต๊ะ ', 'ถั่วฝักยาว 30 กรัม'], '4', '10', '10'],
    ['แกงไก่หน่อไม้ดอง', 'https://scm-assets.constant.co/scm/unilever/1d398653b55393fd6da9bff8ea193338/d2175818-0326-4032-8887-532459d55c78.jpg', ['นำหน่อไม้ดองไปล้างให้สะอาดแล้วหั่นเป็นแท่งยาวเตรียมไว้', 'ใส่แครอท บรอคโคลี หัวไชเท้า ดอกกะหล่ำ และถั่วฝักยาว ต้มจนสุก', 'หั่นข่า ตะไคร้ พริกชี้ฟ้าแห้ง ปอกกระเทียมและหอมแดงเตรียมไว้', 'นำพริกชี้ฟ้าแห้งกับเกลือโขลกรวมกัน ตามด้วย ข่า ตะไคร้ กระเทียม หอมแดง และผิวมะกรูด โขลกทุกอย่างรวมกันให้ละเอียด แล้วใส่กะปิ โขลกจนเป็นเนื้อเดียว', 'นำไก่บ้านมาสับเป็นชิ้นๆ แยกส่วนกัน ทั้งสะโพก อก น่อง', 'ตั้งหม้อ ใส่น้ำ พอเดือด เอาไก่ที่เราหั่นเป็นชิ้นเตรียมไว้และหน่อไม้ลงไปรวนให้พอสุก', 'ตักแกงเผ็ดไก่บ้านหน่อไม้ดองใส่ถ้วยเสิร์ฟพร้อมข้าวสวยหุงสุก'], ['ข้าวเปล่า 1 ถ้วย', 'น้ำเปล่า 500 มิลลิลิตร', 'ซุปหมูก้อน คนอร์ เนเชอรัล 1 ก้อน ', 'แครอท 30 กรัม', 'หัวไชเท้า 30 กรัม', 'บรอคโคลี 30 กรัม', 'ดอกกะหล่ำ 30 กรัม ', 'แซลมอนบด 100 กรัม ', 'แซลมอนหั่นเต๋า 100 กรัม ', 'ซอสมะเขือเทศ 2 ช้อนโต๊ะ ', 'ถั่วฝักยาว 30 กรัม'], '4', '10', '10'],
  ];
  constructor(public http: HttpClient) {
    console.log('Hello FoodListProvider Provider');
  }

}
