import { HttpClient } from '@angular/common/http';
import { Injectable } from '@angular/core';

/*
  Generated class for the FoodListProvider provider.

  See https://angular.io/guide/dependency-injection for more info on providers
  and Angular DI.
*/
@Injectable()
export class FoodListProvider {
  food_list: any = [
    ['ซุปไข่มักกะโรนี', 
      'https://scm-assets.constant.co/scm/unilever/a6798e909fa57bfd19c3e7f00737e5d6/f24c927c-9420-436c-9873-8e814487acfb.jpg',
      ['ตั้งหม้อบนเตาแก๊สจากนั้นใส่น้ำเปล่าลงไป โดยใช้ไฟปานกลาง เมื่อน้ำเริ่มเดือดให้ใส่ ซุปไก่ก้อน คนอร์ เนเชอรัล ลงไปในน้ำเดือด ตามด้วยเกลือและพริกไทย',
      'ใส่แครอทหั่นเต๋าลงไปต้มจนแครอทนิ่มค่อยใส่เนื้อสัตว์เข้าไป', 
      'เมื่อแครอทสุกแล้วใส่กุ้งสดลงไป จากนั้นนำไข่ไก่มาเทลงบนตะแกรง แล้ววนตะแกรงให้ไข่ไหลลงเป็นเส้นลงในหม้อ จากนั้นใช้ทัพพีคนน้ำซุปเพื่อไม่ให้ไข่ติดกัน', 
      'ใส่มักกะโรนีต้มสุกลงไปในหม้อ รอให้น้ำเดือดอีกครั้ง ยกลงจากเตา', 
      'ตักซุปไข่มักกะโรนีใส่ลงในถ้วย ตกแต่งด้วยผักชี'], 
      ['มักกะโรนีต้มสุก 300 กรัม', 'ซุปไก่ก้อน คนอร์ เนเชอรัล 1 ก้อน ', 'ไข่ไก่ 3 ฟอง ', 'กุ้งสด 13 ตัว', 'แครอทหั่นเต๋า 2 หัว', 'เกลือ 2 ช้อนชา ', 'พริกไทยป่น 1 ช้อนชา ', 'น้ำเปล่า 2 ลิตร '],
      '3', 
      '20', 
      '10'
    ],
    ['แกงส้มหนูน้อย', 
      'https://scm-assets.constant.co/scm/unilever/1d398653b55393fd6da9bff8ea193338/48af5aca-cc10-47c7-a371-edea926bfb79.jpg', 
      ['นำหม้อขึ้นตั้งไฟปานกลาง เทน้ำเปล่าลงไป และรอจนเดือด ใส่ ซุปหมูก้อน คนอร์ เนเชอรัล ลงไป ตามด้วยซอสมะเขือเทศ และแซลมอนบด', 
      'ใส่แครอท บรอคโคลี หัวไชเท้า ดอกกะหล่ำ และถั่วฝักยาว ต้มจนสุก', 'ใส่แซลมอนลงไป ต้มจนสุก และยกออกจากเตา', 
      'ตักแกงส้มใส่ชาม และเสิร์ฟพร้อมกับข้าวเปล่า'], 
      ['ข้าวเปล่า 1 ถ้วย', 'น้ำเปล่า 500 มิลลิลิตร', 'ซุปหมูก้อน คนอร์ เนเชอรัล 1 ก้อน ', 'แครอท 30 กรัม', 'หัวไชเท้า 30 กรัม', 'บรอคโคลี 30 กรัม', 'ดอกกะหล่ำ 30 กรัม ', 'แซลมอนบด 100 กรัม ', 'แซลมอนหั่นเต๋า 100 กรัม ', 'ซอสมะเขือเทศ 2 ช้อนโต๊ะ ', 'ถั่วฝักยาว 30 กรัม'],
      '4', 
      '10', 
      '10'
    ],
    ['แกงไก่หน่อไม้ดอง', 
      'https://scm-assets.constant.co/scm/unilever/1d398653b55393fd6da9bff8ea193338/d2175818-0326-4032-8887-532459d55c78.jpg', 
      ['นำหน่อไม้ดองไปล้างให้สะอาดแล้วหั่นเป็นแท่งยาวเตรียมไว้', 'ใส่แครอท บรอคโคลี หัวไชเท้า ดอกกะหล่ำ และถั่วฝักยาว ต้มจนสุก', 'หั่นข่า ตะไคร้ พริกชี้ฟ้าแห้ง ปอกกระเทียมและหอมแดงเตรียมไว้', 'นำพริกชี้ฟ้าแห้งกับเกลือโขลกรวมกัน ตามด้วย ข่า ตะไคร้ กระเทียม หอมแดง และผิวมะกรูด โขลกทุกอย่างรวมกันให้ละเอียด แล้วใส่กะปิ โขลกจนเป็นเนื้อเดียว', 'นำไก่บ้านมาสับเป็นชิ้นๆ แยกส่วนกัน ทั้งสะโพก อก น่อง', 'ตั้งหม้อ ใส่น้ำ พอเดือด เอาไก่ที่เราหั่นเป็นชิ้นเตรียมไว้และหน่อไม้ลงไปรวนให้พอสุก', 'ตักแกงเผ็ดไก่บ้านหน่อไม้ดองใส่ถ้วยเสิร์ฟพร้อมข้าวสวยหุงสุก'], 
      ['ข้าวเปล่า 1 ถ้วย', 'น้ำเปล่า 500 มิลลิลิตร', 'ซุปหมูก้อน คนอร์ เนเชอรัล 1 ก้อน ', 'แครอท 30 กรัม', 'หัวไชเท้า 30 กรัม', 'บรอคโคลี 30 กรัม', 'ดอกกะหล่ำ 30 กรัม ', 'แซลมอนบด 100 กรัม ', 'แซลมอนหั่นเต๋า 100 กรัม ', 'ซอสมะเขือเทศ 2 ช้อนโต๊ะ ', 'ถั่วฝักยาว 30 กรัม'], 
      '4', 
      '10', 
      '10'
    ],
    ['ต้มยำไก่บ้านใบมะขามอ่อน', 
      'https://scm-assets.constant.co/scm/unilever/1d398653b55393fd6da9bff8ea193338/477463e1-9be6-425b-bf83-0b5e6a686c0b.jpg', 
      ['นำไก่บ้านที่ล้างให้สะอาดแล้วมาสับเป็นชิ้นพอดีคำ แล้วพักเอาไว้เตรียมนำไปทำต้มยำ', 'นำหม้อใส่น้ำเปล่ายกขึ้นตั้งไฟโดยใช้ปานกลาง เมื่อน้ำเริ่มร้อนใส่ คนอร์ซุปไก่ก้อน ลงไปในหม้อ ตามด้วยข่า ตะไคร้ พริกขี้หนูบุบ และเนื้อไก่ลงไป คอยช้อนฟองเรื่อย ๆ เพื่อให้น้ำซุปใสขึ้นค่ะ', 'เมื่อเนื้อไก่เริ่มสุกให้ปรุงรสด้วยน้ำปลา เกลือ และพริกขี้หนูบุบ ตามด้วยใบมะขามอ่อนคนให้เข้ากันแล้วปิดไฟ ยกลงจากเตาเตรียมจัดเสิร์ฟได้เลย', 'ตักต้มยำไก่บ้านใบมะขามอ่อนใส่ในชาม เท่านี้ก็พร้อมกินแล้วจ้า'], 
      ['เนื้อไก่บ้าน 1 / 2 ตัว', 'น้ำเปล่า 2 ลิตร น้ำ', 'ใบมะขามอ่อน 1 ถ้วย', 'ใบมะกรูดฉีก 4 ใบ ใบมะกรูดสด', 'ข่าหั่น 1 หัว', 'พริกขี้หนูบุบ 10 เม็ด พริกขี้หนู', 'ตะไคร้หั่นท่อน 2 ต้น ตะไคร้สด ', 'น้ำปลา 2 ช้อนโต๊ะ น้ำปลา ', 'เกลือ 1 ช้อนชา เกลือ ', 'คนอร์ซุปไก่ก้อน 1 ก้อน', 'ผักชีฝรั่ง สำหรับโรยหน้า'], 
      '4', 
      '30', 
      '20'
    ],
    ['อุด้งต้มโคล้งปลาสลิดทอด', 
      'https://scm-assets.constant.co/scm/unilever/a6798e909fa57bfd19c3e7f00737e5d6/af1021d4-3645-4e70-b7b9-bfab248dd941.png', 
      ['ปอกหอมเเดง กระเทียม ทุบหอมเเดง กระเทียมเบาๆ หั่นมะเขือเทศ ซอยผข่า หั่นตะไคร้ยาวประมาณหนึ่งนิ้วทุบพอให้มีกลิ่นเบาๆ ฉีกใบมะกรูดเตรียมไว้', 'ตั้งกระทะคั่ว หอมเเดง กระเทียม ตะไคร้ พริกเเห้ง ข่า ให้มีกลิ่นหอมยิ่งขึ้น คั่วไปอ่อนพอมีกลิ่นหอมตักพักเตรียมไว้', 'เมื่อแครอทสุกแล้วใส่กุ้งสดลงไป จากนั้นนำไข่ไก่มาเทลงบนตะแกรง แล้ววนตะแกรงให้ไข่ไหลลงเป็นเส้นลงในหม้อ จากนั้นใช้ทัพพีคนน้ำซุปเพื่อไม่ให้ไข่ติดกัน', 'ตั้งกระทะ ใส่น้ำมัน ทอดปลาสลิดลงในกระทะ จนสุกกรอบ ตักพักให้หายร้อน เเกะก้างปลาออกเตรียมไว้สองส่วน อีกส่วนนำเนื้อไปตำในครกให้ละเอียดเตรียมไว้ อีกส่วนเเกะเตรียมไว้ใส่เป็นชิ้น','คั้นนำมะขามเปียก เเยกกากเตรียมไว้','ตั้งหม้อใส่นำต้มให้เดือด ใส่ซุปก้อน ใส่สมุนไพรที่คั่วเตรียมไว้ในหม้อ ใส่มะเขือเทศ ใส่ปลาสลิดที่ตำไว้รอเดือด ปรุงรสด้วยน้ำมะขามเปียก น้ำปลา น้ำตาล เกลือ พริกป่น บีบมะนาวเพิ่มความหอม ใส่ปลาสลิดชิ้นที่เเกะไว้ลงในหม้อ ใส่ใบกะเพราแล้วปิดไฟพักรอไว้','ตั้งหม้อน้ำ ลวกเส้นอุด้งจนสุก ตักพักให้สะเด็ดน้ำ','ใส่เส้นอุด้งจัดใส่ถ้วย ตักราดด้วยต้มโคล้ง โรยหน้าด้วยปลาสลิด พร้อมเสิร์ฟ'], 
      ['ปลาสลิดบางบ่อ (วัตถุดิบหลักหั่นท่อน1.5 นิ้ว) 200 กรัม', 'พริกขี้หนูเเห้ง 8-10 เม็ด', 'หอมเเดง 4 หัว', 'กระเทียม 4 กลีบ', 'ตะไคร้หั่นท่อน 2 นิ้วบุป 1 ต้น', 'ข่าหั่นแว่น 6 แว่น', 'ใบมะกรูดฉีก 5 ใบ', 'น้ำเปล่า 3 ถ้วยตวง ', 'มะเขือเทศศรีดา ผ่าครึ่ง 3 ลูก', 'คนอร์ซุปไก่ก้อน 1 ก้อน', 'มะนาว, น้ำปลา, น้ำตาล, เกลือ, พริกป่น และมะขามเปียกสำหรับปรุงรสตามชอบ','ใบกะเพราตามชอบ','เส้นอุด้งลวก 200 กรัม'], 
      '3', 
      '30', 
      '20'
    ],
    ['ไก่กรอบลาบแซ่บ', 
      'https://scm-assets.constant.co/scm/unilever/1d398653b55393fd6da9bff8ea193338/f067e784-5b73-49cc-8067-ec0a53afb4bb.jpg', 
      ['เริ่มแรกให้ล้างปีกบนไก่ให้สะอาด แล้วซับด้วยกระดาษทิชชูให้แห้ง', 'โรยเกลือป่น พริกไทยดำป่นแล้วคลุกเคล้าให้ทั่ว', 'คลุกไก่กับแป้งทอดกรอบจนติดทั่วชิ้น', 'นำไก่ไปทอดในน้ำมันร้อนปานกลาง จนสุกเหลืองกรอบ แล้วตักขึ้นสะเด็ดน้ำมัน','โรยคนอร์สูตรสำเร็จ ลาบ-น้ำตก แล้วคลุกเคล้าให้เคลือบไก่ทอดทั่วกันดี ใส่จานเสิร์ฟพร้อมผักสดได้เลย'], 
      ['เนื้อไก่ปีกบนไก่ (น่องไก่เล็ก) 500 กรัม', 'เกลือป่นและพริกไทยดำป่นปริมาณเล็กน้อยสำหรับหมักไก่', 'แป้งทอดกรอบ 1 ถ้วย', 'คนอร์สูตรสำเร็จ ลาบ-น้ำตก 2 ซอง', 'น้ำมันพืชสำหรับทอดไก่', 'ผักสดเครื่องเคียง อย่างเช่นกะหล่ำปลี แตงกวา ถั่วฝักยาว โหระพา'], 
      '3', 
      '15', 
      '10'
    ],
    ['ไข่เจียวลาบ', 
      'https://scm-assets.constant.co/scm/unilever/1d398653b55393fd6da9bff8ea193338/558cea1d-cdec-4260-9cd1-39408802db00.jpg', 
      ['ตอกไข่ใส่ชาม แล้วตีไข่ด้วยส้อมจนขึ้นฟู', 'ใส่น้ำมันลงกระทะก้นลึก ตั้งไฟร้อนปานกลาง ลองหยอดไข่ที่ตีไว้ลงไปเล็กน้อย ถ้าไข่ที่หยอดลงไปสุกฟูทันที แสดงว่าน้ำมันร้อนได้ที่แล้ว จึงเทไข่ที่เตรียมไว้ลงไปทอดทั้งหมดได้เลย', 'เมื่อไข่ด้านล่างเริ่มเหลืองกรอบให้กลับด้านไข่เจียว แล้วทอดจนเหลืองกรอบทั้งสองด้าน', 'ตักขึ้นให้สะเด็ดน้ำมันแล้วจัดใส่จาน','ผสมหอมแดง ต้นหอม ผักชีฝรั่ง สะระแหน่ กับคนอร์สูตรสำเร็จ ลาบ-น้ำตก คลุกเคล้าให้เข้ากัน ถ้าแห้งเกินไป สามารถเติมน้ำเปล่าต้มสุกใส่ลงไปพอให้ขลุกขลิกได้เช่นกัน จากนั้นตักราดบนไข่เจียว รับรองว่าอร่อยแซ่บสุดๆ'], 
      ['ไข่ไก่ 4 ฟอง', 'หอมแดงซอย 2 ช้อนโต๊ะ', 'ต้นหอมซอย 2 ช้อนโต๊ะ', 'ผักชีฝรั่งซอย 2 ช้อนโต๊ะ', 'สะระแหน่เด็ดใบ ½ ถ้วย', 'คนอร์สูตรสำเร็จ ลาบ-น้ำตก 2 ช้อนโต๊ะ','น้ำมันพืชสำหรับเจียวไข่'], 
      '1', 
      '10', 
      '5'
    ],
    ['โรตีแกงเขียวหวานเนื้อ', 
      'https://scm-assets.constant.co/scm/unilever/a6798e909fa57bfd19c3e7f00737e5d6/7a18f3a0-91a4-468a-bd97-5813c6c7a3a3.jpg', 
      ['เริ่มทำแกงเขียวหวานเนื้อ ใส่กะทิลงในหม้อแล้วยกขึ้นตั้งไฟจนเดือด ใส่คนอร์สูตรสำเร็จแกงเขียวหวานลงไป คนจนละลายเข้ากันดี', 'พอน้ำแกงเดือดอีกครั้งใส่เนื้อวัวลงไป แล้วคนให้เข้ากัน', 'ใส่มะเขือพวง ใบมะกรูด พริกชี้ฟ้าลงไปต้มจนสุกตามความชอบ หากชอบผักนิ่มๆ สามารถต้มให้นานขึ้นจนผักเปื่อยนุ่มได้', 'ใส่ใบโหระพาลงไป แล้วปิดไฟตักใส่ชามเสิร์ฟได้เลย','ลงมือทอดโรตี ตั้งกระทะบนไฟกลาง ใส่เนยลงไป พอเนยเริ่มละลายใส่โรตีลงทอดจนเหลือง และกลิ่นหอม จากนั้นหั่นเป็นชิ้น จัดใส่จาน ทานคู่กับแกงเขียวหวานเนื้อ รับรองอร่อยสุดๆ'], 
      ['กะทิ 2 ถ้วย', 'คนอร์สูตรสำเร็จแกงเขียวหวาน 1 ซอง', 'สันในเนื้อวัวแล่เป็นชิ้นบาง 200 กรัม', 'มะเขือพวง ½ ถ้วย', 'ใบมะกรูดฉีก 4 ใบ', 'พริกชี้ฟ้าแดงซอย 1 เม็ด','โหระพาเด็ดใบ 1 ถ้วย','เนยสดชนิดจืดสำหรับทอดโรตี 1 ช้อนโต๊','แผ่นแป้งโรตีแช่แข็ง 3 แผ่น'], 
      '2', 
      '20', 
      '15'
    ],
  ];
  constructor(public http: HttpClient) {
    
  }

}
